Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
- destroy

Terraform will perform the following actions:

  # module.community-prometheus.helm_release.community-prometheus will be updated in-place
~ resource "helm_release" "community-prometheus" {
      ~ id                         = "kube-prometheus-stack" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v0.87.1" -> (known after apply)
          ~ chart          = "kube-prometheus-stack" -> (known after apply)
          ~ first_deployed = 1766171883 -> (known after apply)
          ~ last_deployed  = 1766858736 -> (known after apply)
          ~ name           = "kube-prometheus-stack" -> (known after apply)
          ~ namespace      = "monitoring" -> (known after apply)
          ~ notes          = <<-EOT
                1. Get your 'admin' user password by running:
                
                   kubectl get secret --namespace monitoring kube-prometheus-stack-grafana -o jsonpath="{.data.admin-password}" | base64 --decode ; echo
                
                
                2. The Grafana server can be accessed via port 80 on the following DNS name from within your cluster:
                
                   kube-prometheus-stack-grafana.monitoring.svc.cluster.local
                
                   Get the Grafana URL to visit by running these commands in the same shell:
                     export POD_NAME=$(kubectl get pods --namespace monitoring -l "app.kubernetes.io/name=grafana,app.kubernetes.io/instance=kube-prometheus-stack" -o jsonpath="{.items[0].metadata.name}")
                     kubectl --namespace monitoring port-forward $POD_NAME 3000
                
                3. Login with the password from step 1 and the username: admin
                #################################################################################
                ######   WARNING: Persistence is disabled!!! You will lose your data when   #####
                ######            the Grafana pod is terminated.                            #####
                #################################################################################
                
                kube-state-metrics is a simple service that listens to the Kubernetes API server and generates metrics about the state of the objects.
                The exposed metrics can be found here:
                https://github.com/kubernetes/kube-state-metrics/blob/master/docs/README.md#exposed-metrics
                
                The metrics are exported on the HTTP endpoint /metrics on the listening port.
                In your case, kube-prometheus-stack-kube-state-metrics.monitoring.svc.cluster.local:8080/metrics
                
                They are served either as plaintext or protobuf depending on the Accept header.
                They are designed to be consumed either by Prometheus itself or by a scraper that is compatible with scraping a Prometheus client endpoint.
                
                1. Get the application URL by running these commands:
                  export POD_NAME=$(kubectl get pods --namespace monitoring -l "app.kubernetes.io/name=prometheus-node-exporter,app.kubernetes.io/instance=kube-prometheus-stack" -o jsonpath="{.items[0].metadata.name}")
                  echo "Visit http://127.0.0.1:9100 to use your application"
                  kubectl port-forward --namespace monitoring $POD_NAME 9100
                kube-prometheus-stack has been installed. Check its status by running:
                  kubectl --namespace monitoring get pods -l "release=kube-prometheus-stack"
                
                Get Grafana 'admin' user password by running:
                
                  kubectl --namespace monitoring get secrets kube-prometheus-stack-grafana -o jsonpath="{.data.admin-password}" | base64 -d ; echo
                
                Access Grafana local instance:
                
                  export POD_NAME=$(kubectl --namespace monitoring get pod -l "app.kubernetes.io/name=grafana,app.kubernetes.io/instance=kube-prometheus-stack" -oname)
                  kubectl --namespace monitoring port-forward $POD_NAME 3000
                
                Get your grafana admin user password by running:
                
                  kubectl get secret --namespace monitoring -l app.kubernetes.io/component=admin-secret -o jsonpath="{.items[0].data.admin-password}" | base64 --decode ; echo
                
                
                Visit https://github.com/prometheus-operator/kube-prometheus for instructions on how to create & configure Alertmanager and Prometheus instances using the Operator.
            EOT -> (known after apply)
          ~ revision       = 12 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - grafana = {
                      - env = {
                          - GF_AUTH_BASIC_ENABLED                            = false
                          - GF_AUTH_DISABLE_LOGIN_FORM                       = true
                          - GF_AUTH_GENERIC_OAUTH_ALLOW_ASSIGN_GRAFANA_ADMIN = true
                          - GF_AUTH_GENERIC_OAUTH_ALLOW_SIGN_UP              = true
                          - GF_AUTH_GENERIC_OAUTH_API_URL                    = "https://auth.billv.ca/application/o/userinfo/"
                          - GF_AUTH_GENERIC_OAUTH_AUTH_URL                   = "https://auth.billv.ca/application/o/authorize/"
                          - GF_AUTH_GENERIC_OAUTH_CLIENT_ID                  = "Qzag1XSErMXdad1boBF6"
                          - GF_AUTH_GENERIC_OAUTH_CLIENT_SECRET              = "(sensitive value)"
                          - GF_AUTH_GENERIC_OAUTH_ENABLED                    = true
                          - GF_AUTH_GENERIC_OAUTH_NAME                       = "Authentik"
                          - GF_AUTH_GENERIC_OAUTH_ROLE_ATTRIBUTE_PATH        = "contains(groups[*], 'Grafana_Admins') && 'GrafanaAdmin' || 'Viewer'"
                          - GF_AUTH_GENERIC_OAUTH_SCOPES                     = "openid profile email"
                          - GF_AUTH_GENERIC_OAUTH_TOKEN_URL                  = "https://auth.billv.ca/application/o/token/"
                          - GF_SERVER_ROOT_URL                               = "https://grafana.billv.ca/"
                        }
                    }
                }
            ) -> (known after apply)
          ~ version        = "80.7.0" -> (known after apply)
        } -> (known after apply)
        name                       = "kube-prometheus-stack"
      ~ version                    = "80.7.0" -> "80.6.0"
        # (28 unchanged attributes hidden)
    }

  # module.octoeverywhere.kubernetes_namespace_v1.namespace will be destroyed
  # (because kubernetes_namespace_v1.namespace is not in configuration)
- resource "kubernetes_namespace_v1" "namespace" {
      - id                               = "octoeverywhere" -> null
      - wait_for_default_service_account = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "octoeverywhere" -> null
          - resource_version = "126993514" -> null
          - uid              = "9991e702-1001-4efe-8554-53d000ce6417" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.octoeverywhere.kubernetes_stateful_set_v1.octoeverywhere will be destroyed
  # (because kubernetes_stateful_set_v1.octoeverywhere is not in configuration)
- resource "kubernetes_stateful_set_v1" "octoeverywhere" {
      - id               = "octoeverywhere/octoeverywhere" -> null
      - wait_for_rollout = true -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 1 -> null
          - labels           = {} -> null
          - name             = "octoeverywhere" -> null
          - namespace        = "octoeverywhere" -> null
          - resource_version = "163501329" -> null
          - uid              = "0e1a02c3-49c9-4c64-832e-b4bc5f486bfa" -> null
            # (1 unchanged attribute hidden)
        }

      - spec {
          - min_ready_seconds      = 0 -> null
          - pod_management_policy  = "OrderedReady" -> null
          - replicas               = "1" -> null
          - revision_history_limit = 0 -> null
          - service_name           = "octoeverywhere" -> null

          - persistent_volume_claim_retention_policy {
              - when_deleted = "Retain" -> null
              - when_scaled  = "Retain" -> null
            }

          - selector {
              - match_labels = {
                  - "app" = "octoeverywhere"
                } -> null
            }

          - template {
              - metadata {
                  - annotations      = {} -> null
                  - generation       = 0 -> null
                  - labels           = {
                      - "app" = "octoeverywhere"
                    } -> null
                    name             = null
                    # (4 unchanged attributes hidden)
                }
              - spec {
                  - active_deadline_seconds          = 0 -> null
                  - automount_service_account_token  = true -> null
                  - dns_policy                       = "ClusterFirst" -> null
                  - enable_service_links             = true -> null
                  - host_ipc                         = false -> null
                  - host_network                     = false -> null
                  - host_pid                         = false -> null
                  - node_selector                    = {} -> null
                  - restart_policy                   = "Always" -> null
                  - scheduler_name                   = "default-scheduler" -> null
                  - share_process_namespace          = false -> null
                  - termination_grace_period_seconds = 30 -> null
                    # (6 unchanged attributes hidden)

                  - container {
                      - args                       = [] -> null
                      - command                    = [] -> null
                      - image                      = "octoeverywhere/octoeverywhere:latest" -> null
                      - image_pull_policy          = "Always" -> null
                      - name                       = "octoeverywhere" -> null
                      - stdin                      = false -> null
                      - stdin_once                 = false -> null
                      - termination_message_path   = "/dev/termination-log" -> null
                      - termination_message_policy = "File" -> null
                      - tty                        = false -> null
                        # (2 unchanged attributes hidden)

                      - env {
                          - name  = "COMPANION_MODE" -> null
                          - value = "elegoo" -> null
                        }
                      - env {
                          - name  = "PRINTER_IP" -> null
                          - value = "10.202.0.22" -> null
                        }

                      - resources {
                          - limits   = {} -> null
                          - requests = {} -> null
                        }

                      - volume_mount {
                          - mount_path        = "/data" -> null
                          - mount_propagation = "None" -> null
                          - name              = "data" -> null
                          - read_only         = false -> null
                            # (2 unchanged attributes hidden)
                        }
                    }
                }
            }

          - volume_claim_template {
              - metadata {
                  - annotations      = {} -> null
                  - generation       = 0 -> null
                  - labels           = {} -> null
                  - name             = "data" -> null
                  - namespace        = "default" -> null
                    # (3 unchanged attributes hidden)
                }
              - spec {
                  - access_modes       = [
                      - "ReadWriteOnce",
                    ] -> null
                  - storage_class_name = "longhorn" -> null
                  - volume_mode        = "Filesystem" -> null
                    # (1 unchanged attribute hidden)

                  - resources {
                      - limits   = {} -> null
                      - requests = {
                          - "storage" = "5Gi"
                        } -> null
                    }
                }
            }
        }
    }

Plan: 0 to add, 1 to change, 2 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.billv.ca/lock?id=billv-ca%252Fhomelab-atlantis-k3s-services%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```
Plan: 0 to add, 1 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```